CustomLinearKaimingModel(
  (layer1): Linear(in_features=50, out_features=20, bias=True)
  (layer2): Linear(in_features=20, out_features=15, bias=True)
  (output_layer): Linear(in_features=15, out_features=5, bias=True)
)